In [118]:

import pandas as pd

obj = pd.Series([4,7,-5,3])
obj

#if you did "from pandas import Series,DataFrame" then without using pd.Series we coud crete the columns.

0    4
1    7
2   -5
3    3
dtype: int64

In [119]:
obj.values
#tells us the values

array([ 4,  7, -5,  3], dtype=int64)

In [120]:
obj.index #tells us the indices

RangeIndex(start=0, stop=4, step=1)

In [121]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2 
#changing th order of the indices will accordingly label each value differently than it is now

d    4
b    7
a   -5
c    3
dtype: int64

In [122]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [123]:

obj2['a']=78
obj2

d     4
b     7
a    78
c     3
dtype: int64

In [124]:
import numpy as np
np.exp(6)

403.4287934927351

In [125]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [126]:
obj2

d     4
b     7
a    78
c     3
dtype: int64

In [128]:
print('hey')

hey

In [129]:
obj2*2 #any operation carried out is done to the entire series

d      8
b     14
a    156
c      6
dtype: int64

In [130]:
obj2

d     4
b     7
a    78
c     3
dtype: int64

In [131]:
'b' in obj2 #checking if the index b has a value

True

In [132]:
'g' in obj2 #since g does not exist, we get a false entry

False

In [133]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [134]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [135]:
states = {'California', 'Ohio', 'Oregon', 'Texas'}
states

{'California', 'Ohio', 'Oregon', 'Texas'}

In [136]:
obj4 = pd.Series(sdata, index = states) #I can chaneg the order int his manner, of the entries
obj4

Texas         71000.0
California        NaN
Ohio          35000.0
Oregon        16000.0
dtype: float64

In [137]:
pd.isnull(obj4) #to check which entry has no value

Texas         False
California     True
Ohio          False
Oregon        False
dtype: bool

In [138]:
pd.notnull(obj4) #to check which entry has value

Texas          True
California    False
Ohio           True
Oregon         True
dtype: bool

In [139]:
obj3+obj4 #merging to 2 series, simply by just adding them

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [140]:
#pandas automatically adds aligns differently indexed data in arithmatic operations based on their same index

In [141]:
obj4.name = 'POPULATION' #name of data which the series represents
obj4.index.name = 'STATES' #name of the indices in the series
obj4

STATES
Texas         71000.0
California        NaN
Ohio          35000.0
Oregon        16000.0
Name: POPULATION, dtype: float64

In [142]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [143]:
obj.index = ['Bobby','Andrew','Julie','Karen']
obj.index.name = 'NAMES'
obj.name = 'AGE'
obj

NAMES
Bobby     4
Andrew    7
Julie    -5
Karen     3
Name: AGE, dtype: int64

In [144]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada'], 'Year':[2000,2001,2002,2003,2004],'Population':[1.5,1.7,3.6,2.4,2.9]}
frame = pd.DataFrame(data)
frame

#DataFrame is a tabular datesheet like structure.
#Just like Series, data gets automatically aligned.

    state  Year  Population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2003         2.4
4  Nevada  2004         2.9

In [145]:
pd.DataFrame(data,columns = ['state','Population','state']) #We can reorder the column sequence using this.

    state  Population   state
0    Ohio         1.5    Ohio
1    Ohio         1.7    Ohio
2    Ohio         3.6    Ohio
3  Nevada         2.4  Nevada
4  Nevada         2.9  Nevada

In [146]:
frame2 = pd.DataFrame(data, columns = ['Year','state','Population','Debt'], index = ['one','two','three','four','five'])
frame2

       Year   state  Population Debt
one    2000    Ohio         1.5  NaN
two    2001    Ohio         1.7  NaN
three  2002    Ohio         3.6  NaN
four   2003  Nevada         2.4  NaN
five   2004  Nevada         2.9  NaN

In [147]:
frame2.columns #tells us about all the columns

Index(['Year', 'state', 'Population', 'Debt'], dtype='object')

In [148]:
frame2['state'] #used to access a column in particular.

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [149]:
frame2

       Year   state  Population Debt
one    2000    Ohio         1.5  NaN
two    2001    Ohio         1.7  NaN
three  2002    Ohio         3.6  NaN
four   2003  Nevada         2.4  NaN
five   2004  Nevada         2.9  NaN

In [150]:
frame2['debt']=134.89 ##All enries get this value

In [151]:
frame2

       Year   state  Population Debt    debt
one    2000    Ohio         1.5  NaN  134.89
two    2001    Ohio         1.7  NaN  134.89
three  2002    Ohio         3.6  NaN  134.89
four   2003  Nevada         2.4  NaN  134.89
five   2004  Nevada         2.9  NaN  134.89

In [152]:
import pandas as pd
val = pd.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])
frame2['debt']=val
frame2
#only the indices mentioned have their data amended

       Year   state  Population Debt  debt
one    2000    Ohio         1.5  NaN   NaN
two    2001    Ohio         1.7  NaN  -1.2
three  2002    Ohio         3.6  NaN   NaN
four   2003  Nevada         2.4  NaN  -1.5
five   2004  Nevada         2.9  NaN  -1.7

In [153]:
frame2['eastern'] = frame2.state=='Ohio' #A booleaan expression gets evaluated here.
frame2

       Year   state  Population Debt  debt  eastern
one    2000    Ohio         1.5  NaN   NaN     True
two    2001    Ohio         1.7  NaN  -1.2     True
three  2002    Ohio         3.6  NaN   NaN     True
four   2003  Nevada         2.4  NaN  -1.5    False
five   2004  Nevada         2.9  NaN  -1.7    False

In [154]:
frame2.columns

Index(['Year', 'state', 'Population', 'Debt', 'debt', 'eastern'], dtype='object')

In [155]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}} #Outer dictionaries as columns and inner dictionaries as rows

#So using nested dictionary arrangement, we can make a DataFrame.

In [156]:
frame3 = pd.DataFrame(pop, columns=['Ohio','Nevada'])
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [157]:
#Transposing the above result
#transposal is an important aspect.
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [158]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [159]:
pd.DataFrame(pop,index=[2001,2002,2003,2000]) 
#We can put the index but in actuality,whatever data is specified in the dictionARY WILL BE DISPLAYED.

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN
2000     NaN   1.5

In [160]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [161]:
#We should also know how to name the columns and the axis
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [162]:
frame3.values 
#Values are displayed as a 2d matrix, without the column or row headings. So it becomes a little confusing. But dont worry. Things aare understandable with a little reference

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [163]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [164]:
frame3['Ohio'][:2]

year
2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [165]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c',])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [166]:
#Sets a new index. This is used when we find out that a new index is required or that we are introducing missing values.
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [167]:
#using the fill_value method. The reindex method introduces missing values if the data is not already present
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [168]:
#Incase of ordered data like time series, it may be desirable to do some interpolation or filling values while reindexing. In such case we use a method called fill.

obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [169]:
obj3.reindex(range(6), method='ffill') 
#The range(6) corresponds to the new index and the method='ffill' automatically fills information on the basis of the series that the user has provided
#this I believe might be used for interpolation.

#ffill: Fill values forward
#bfill: Fill values backwards.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [170]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [171]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [172]:
framex = pd.DataFrame(np.arange(12).reshape((3,4)),index=['a','c','d'],columns = ['Ohio','Texas','California','Georgia'])
framex
framex.T

            a  c   d
Ohio        0  4   8
Texas       1  5   9
California  2  6  10
Georgia     3  7  11

In [173]:
frame2 = frame.reindex(['a','b','c','d'])
frame2
#reindex can alter the rows(index), columns or both.

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [174]:
states = ['Texas','Utah','California']
frame2.reindex(columns=states)
#as Utah replaced Ohio, all the entries of Ohio were removed.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [175]:
frame.reindex(index=['a','b','c','d'],columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [180]:
from pandas import Series, DataFrame
import pandas as pd
obj = Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [181]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [183]:
obj.drop(['c','d'])

a    0
b    1
e    4
dtype: int32

In [186]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
data.drop(['Colorado','Ohio'])#vwery important when we have to edit and filter out the data.

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [193]:
data.drop('two',axis=1) #Write the axis

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15